jmeter_files/отчет/report/statistics.json
{
  "TG_14rps" : {
    "transaction" : "TG_14rps",
    "sampleCount" : 4219,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.7859682389191767,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 154.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 6.0,
    "throughput" : 14.06647484604895,
    "receivedKBytesPerSec" : 0.027473583683689358,
    "sentKBytesPerSec" : 0.0
  },
  "TG_5rps" : {
    "transaction" : "TG_5rps",
    "sampleCount" : 1498,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.4158878504672894,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 759.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 5.0,
    "throughput" : 4.99388266042598,
    "receivedKBytesPerSec" : 0.009753677071144494,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 12326,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.9798799286062027,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 936.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 7.0,
    "throughput" : 10.26385758168993,
    "receivedKBytesPerSec" : 0.02004497047246553,
    "sentKBytesPerSec" : 0.0
  },
  "TG_10rps" : {
    "transaction" : "TG_10rps",
    "sampleCount" : 2998,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.5787191460973995,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 120.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 4.0,
    "throughput" : 9.9952657513786,
    "receivedKBytesPerSec" : 0.01952200342066133,
    "sentKBytesPerSec" : 0.0
  },
  "TG_12rps" : {
    "transaction" : "TG_12rps",
    "sampleCount" : 3610,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.099722991689753,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 186.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 10.0,
    "throughput" : 12.0362621571249,
    "receivedKBytesPerSec" : 0.02350832452563457,
    "sentKBytesPerSec" : 0.0
  },
  "Counter init" : {
    "transaction" : "Counter init",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 936.0,
    "medianResTime" : 936.0,
    "minResTime" : 936.0,
    "maxResTime" : 936.0,
    "pct1ResTime" : 936.0,
    "pct2ResTime" : 936.0,
    "pct3ResTime" : 936.0,
    "throughput" : 1.0683760683760686,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  }
}